# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'git'
brew 'node'
brew 'trash'
brew 'wget'

# Apps
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'cakebrew'
cask 'docker'
cask 'franz'
cask 'github-desktop'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'handbrake'
cask 'hyper'
cask 'keepingyouawake'
cask 'postman'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
