# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'tree'
brew 'node'
brew 'trash'
brew 'wget'
brew 'asciinema' # https://asciinema.org/

# PHP
brew 'php70', args: ['with-debug', 'without-apache']

# Apps
cask '1password'
cask 'alfred'
cask 'atom'
cask 'backblaze'
cask 'bartender'
cask 'cakebrew'
cask 'coderunner'
cask 'docker'
cask 'fluid'
cask 'franz'
cask 'github-desktop'
cask 'google-chrome'
cask 'handbrake'
cask 'hyper'
cask 'keepingyouawake'
cask 'mailplane'
cask 'paw'
cask 'plex-media-server'
cask 'sketch'
cask 'querious'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
