# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
# brew 'node'
# brew 'trash'
# brew 'wget'

# Apps
cask 'alfred'
cask 'brave-browser'
cask 'choosy'
cask 'figma'
cask 'github'
cask 'google-backup-and-sync'
cask 'graphiql'
cask 'handbrake'
cask 'hyper'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'postman'
cask 'telegram-desktop'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-fira-code'
